In [3]:
import pandas as pd
import numpy as np
df = pd.DataFrame({ 'A':1,
                    'B':pd.Timestamp('20180924', freq=6),
                    'C':np.array([3] * 4),
                    'D':pd.Categorical(['test', 'train', 'test', 'train']),
                    'F':'foo'
    
})
df

   A          B  C      D    F
0  1 2018-09-24  3   test  foo
1  1 2018-09-24  3  train  foo
2  1 2018-09-24  3   test  foo
3  1 2018-09-24  3  train  foo

In [4]:
df.dtypes

A             int64
B    datetime64[ns]
C             int32
D          category
F            object
dtype: object

In [5]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
df.columns

Index(['A', 'B', 'C', 'D', 'F'], dtype='object')

In [7]:
#Transposing the dataset
df.T

,0,1,2,3
A,1,1,1,1
B,2018-09-24 00:00:00,2018-09-24 00:00:00,2018-09-24 00:00:00,2018-09-24 00:00:00
C,3,3,3,3
D,test,train,test,train
F,foo,foo,foo,foo

In [8]:
df.sort_values(by='D')

   A          B  C      D    F
0  1 2018-09-24  3   test  foo
2  1 2018-09-24  3   test  foo
1  1 2018-09-24  3  train  foo
3  1 2018-09-24  3  train  foo

In [9]:
df2 = pd.read_csv(r"C:\Users\Kamal Dev Sharma\testdirec\sentdex practice\NSE-MARUTI.csv") #we use 'r' for raw string
df2.head()

,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
0,2018-08-17,9243.00,9286.50,9130.00,9149.95,9152.10,477538.0,44002.98
1,2018-08-16,9124.00,9235.95,9085.00,9202.20,9200.55,465479.0,42757.42
2,2018-08-14,9079.00,9158.80,9046.25,9135.00,9132.60,344056.0,31355.62
3,2018-08-13,9119.45,9185.00,9012.20,9107.00,9080.85,348201.0,31750.75
4,2018-08-10,9150.00,9210.00,9105.00,9119.90,9148.25,427827.0,39190.31

In [10]:
df2.dtypes

Date                     object
Open                    float64
High                    float64
Low                     float64
Last                    float64
Close                   float64
Total Trade Quantity    float64
Turnover (Lacs)         float64
dtype: object

In [11]:
df2.Date = pd.to_datetime(df2.Date, format='%Y/%m/%d')
df2.dtypes

Date                    datetime64[ns]
Open                           float64
High                           float64
Low                            float64
Last                           float64
Close                          float64
Total Trade Quantity           float64
Turnover (Lacs)                float64
dtype: object

In [12]:
df2.reset_index(level=0, inplace=True)
df2.head()

,index,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
0,0,2018-08-17,9243.00,9286.50,9130.00,9149.95,9152.10,477538.0,44002.98
1,1,2018-08-16,9124.00,9235.95,9085.00,9202.20,9200.55,465479.0,42757.42
2,2,2018-08-14,9079.00,9158.80,9046.25,9135.00,9132.60,344056.0,31355.62
3,3,2018-08-13,9119.45,9185.00,9012.20,9107.00,9080.85,348201.0,31750.75
4,4,2018-08-10,9150.00,9210.00,9105.00,9119.90,9148.25,427827.0,39190.31

In [13]:
df2[df2['Close']==9152.10]

,index,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
0,0,2018-08-17,9243.0,9286.5,9130.0,9149.95,9152.1,477538.0,44002.98

In [14]:
df2[df2['Date']=='2018-08-17']

,index,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
0,0,2018-08-17,9243.0,9286.5,9130.0,9149.95,9152.1,477538.0,44002.98

In [15]:
df2[df2['Date']=='20180817']

,index,Date,Open,High,Low,Last,Close,Total Trade Quantity,Turnover (Lacs)
0,0,2018-08-17,9243.0,9286.5,9130.0,9149.95,9152.1,477538.0,44002.98

In [32]:
df2.loc[:, ['Date', 'Open']].head()

        Date     Open
0 2018-08-17  9243.00
1 2018-08-16  9124.00
2 2018-08-14  9079.00
3 2018-08-13  9119.45
4 2018-08-10  9150.00

In [65]:
t1 = pd.to_datetime('2003-01-01')
t2 = pd.to_datetime('2003-07-09')
print(t2-t1)

189 days 00:00:00

In [53]:
df2.dtypes

index                            int64
Date                    datetime64[ns]
Open                           float64
High                           float64
Low                            float64
Last                           float64
Close                          float64
Total Trade Quantity           float64
Turnover (Lacs)                float64
dtype: object

In [66]:
df2['Turnover (Lacs)'][(df2['Date'] > t1)]

0        44002.98
1        42757.42
2        31355.62
3        31750.75
4        39190.31
5        59496.38
6        59339.83
7        35727.93
8        22036.30
9        43284.51
10       80368.53
11       65718.40
12       40404.41
13       50246.66
14       62884.00
15      119952.31
16       37593.15
17       73845.34
18       58246.91
19       25687.97
20       18792.04
21       40586.30
22       43029.05
23       20392.00
24       48209.88
25       31753.70
26       31017.82
27       46048.03
28       31142.26
29       47562.10
          ...
3732     13487.00
3733      6665.77
3734      7372.46
3735     13879.96
3736     16922.52
3737     17068.81
3738     11399.27
3739      4993.93
3740      6262.76
3741     14414.35
3742     19124.34
3743     19430.84
3744     14798.84
3745      6479.36
3746      8456.02
3747      9460.96
3748      9640.85
3749      4919.60
3750      7511.53
3751     23147.59
3752      7639.12
3753      5526.65
3754      9011.90
3755      6693.03
3756      6675.70
3757     10920.01
3758     10643.13
3759     20246.22
3760     17448.20
3761     58355.28
Name: Turnover (Lacs), Length: 3762, dtype: float64